In [122]:
##Salary Project
#importing the libraries

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [123]:
#Readind csv file

df=pd.read_csv("https://raw.githubusercontent.com/dsrscientist/dataset3/main/Salaries.csv")
df

         rank discipline  yrs.since.phd  yrs.service   sex  salary
0        Prof          B             19           18  Male  139750
1        Prof          B             20           16  Male  173200
2    AsstProf          B              4            3  Male   79750
3        Prof          B             45           39  Male  115000
4        Prof          B             40           41  Male  141500
..        ...        ...            ...          ...   ...     ...
392      Prof          A             33           30  Male  103106
393      Prof          A             31           19  Male  150564
394      Prof          A             42           25  Male  101738
395      Prof          A             25           15  Male   95329
396  AsstProf          A              8            4  Male   81035

[397 rows x 6 columns]

In [124]:
df.drop(['rank','discipline','yrs.since.phd','sex'], axis=1, inplace=True)
df

     yrs.service  salary
0             18  139750
1             16  173200
2              3   79750
3             39  115000
4             41  141500
..           ...     ...
392           30  103106
393           19  150564
394           25  101738
395           15   95329
396            4   81035

[397 rows x 2 columns]

In [125]:
df.rename(columns={'yrs.service':'service'})

     service  salary
0         18  139750
1         16  173200
2          3   79750
3         39  115000
4         41  141500
..       ...     ...
392       30  103106
393       19  150564
394       25  101738
395       15   95329
396        4   81035

[397 rows x 2 columns]

In [126]:
X = df.drop(['salary'],axis=1)

In [127]:
X

     yrs.service
0             18
1             16
2              3
3             39
4             41
..           ...
392           30
393           19
394           25
395           15
396            4

[397 rows x 1 columns]

In [128]:
y = df['salary']

In [129]:
y

0      139750
1      173200
2       79750
3      115000
4      141500
        ...
392    103106
393    150564
394    101738
395     95329
396     81035
Name: salary, Length: 397, dtype: int64

In [130]:
from sklearn.model_selection import train_test_split

In [170]:
Xtrain,Xtest,ytrain,ytest = train_test_split(X,y,test_size=0.3)

In [171]:
Xtrain.shape

(277, 1)

In [172]:
Xtest.shape

(120, 1)

In [173]:
ytrain.shape

(277,)

In [174]:
ytest.shape

(120,)

In [157]:
#Linear Regression
from sklearn.linear_model import LinearRegression

In [141]:
model = LinearRegression()

In [158]:
#prediction

model.fit(X,y)

LinearRegression()

In [168]:
model.fit(X,y)
next_salary=model.predict([[6]])
print(int(next_salary))

104652

In [175]:
#Accuracy

model.score(Xtrain,ytrain)

0.13158654124163427